; domain
(define (domain farmland)

    (:requirements :typing :fluents)

    (:types
        farm - object
    )

    (:predicates
        (adj ?f1 - farm ?f2 - farm)
    )

    (:functions
        (x ?b - farm)
        (cost)
    )

    ;; Move a person from a unit f1 to a unit f2
    (:action move-fast
        :parameters (?f1 - farm ?f2 - farm)
        :precondition (and (>= (x ?f1) 4) (adj ?f1 ?f2))
        :effect (and(decrease (x ?f1) 4) (increase (x ?f2) 2) (increase (cost) 1))
    )

    (:action move-slow
        :parameters (?f1 - farm ?f2 - farm)
        :precondition (and (>= (x ?f1) 1) (adj ?f1 ?f2))
        :effect (and(decrease (x ?f1) 1) (increase (x ?f2) 1))
    )

)

; problem
(define (problem farmland_5_star)
  (:domain farmland)
  (:objects
    farm0 farm1 farm2 farm3 farm4 - farm
  )
  (:init
    (= (cost) 0)
    (= (x farm0) 12)
    (= (x farm1) 0)
    (= (x farm2) 0)
    (= (x farm3) 0)
    (= (x farm4) 0)
    (adj farm0 farm1)
    (adj farm1 farm0)
    (adj farm0 farm2)
    (adj farm2 farm0)
    (adj farm0 farm3)
    (adj farm3 farm0)
    (adj farm0 farm4)
    (adj farm4 farm0)
  )
  (:goal
    (and
      (>= (x farm1) 1)
      (>= (x farm2) 1)
      (>= (x farm3) 1)
      (>= (x farm4) 1)
    )
  )
)

; plan
1. (move-slow farm0 farm1)
   changed: (x farm0) from 12 to 11, (x farm1) from 0 to 1
   goals met: 1 of 4
2. (move-slow farm0 farm2)
   changed: (x farm0) from 11 to 10, (x farm2) from 0 to 1
   goals met: 2 of 4
3. (move-slow farm0 farm3)
   changed: (x farm0) from 10 to 9, (x farm3) from 0 to 1
   goals met: 3 of 4
4. (move-slow farm0 farm4)
   changed: (x farm0) from 9 to 8, (x farm4) from 0 to 1
   goals met: 4 of 4
